<template>
	<div class="agreement">
		<div>平台认证支付服务协议</div>
		<p>用户通过网络页面点击确认或以其他方式选择接受本协议，即表示用户与平台已达成协议并痛殴一接受协议的全部约定内容。
在接受本协议之前，请您仔细阅读本协议的全部内容。如果您不同意本协议的任意内容，或者无法准确理解本协议任何条款的含义，请不要进行后续操作。
您知悉，您在使用本服务时需同时受银行和平台设置的支付限额的约束，您对此无异议。并且，您同意，银行和平台有权根据交易安全需要，随时调整本协议项下的相关交易规则和交易金额限制规定。
使用本服务时，您在提供商品或服务的商家网站或相关使用界面输入身份信息、银行卡信息及支付金额（除此以外，还需要在平台支付页面输入安全产品信息、银行卡预留手机号码以及您所收到的手机短信校验码）后，即视为您确认支付金额及该支付指令并已不可撤销地向包付发出，平台有权根据您的指令并已不可撤销向平台发出，平台有权根据您的指令委托银行或第三方从您银行卡中划扣资金给收款方。届时您不应以未在交易单据中签名、签名不符、非本人意愿交易等原因要求平台退款或承担其他责任。您应确保您是使用本服务的银行卡合法使用权人，可合法、有效使用该银行卡且未侵犯任何第三方合法权益，否则因此造成宝付方、第三方损失的，您应负责赔偿并承担全部法律责任，平台有权对您行使包括但不限于冻结您全部或部分交易资金、从您的交易资金内扣除相应的款项或金额等行为。
您应妥善保管身份证、银行卡等信息，包括但不限于：行卡复印件、银行卡卡号、密码、有效期、发卡行预留的手机号码以及平台安全的产品信息、手机短息校验证码、来自于发卡行和/或平台、向您发送的校验证码等与银行卡有关的一切信息和设备。如您遗失或泄露前述信息和/或设备的，您应及时通知发卡行及/或平台，以减少可能发生的损失。因遗失或泄露前述信息/或设备所致损失由您自行承担。您的原因所致损失亦由您自行承担。
您在使用本服务时，应当认真确认交易信息，包括且不限于商品名称、数量、金额等，并按平台业务流程发出符合本协议约定的指令。您认可和通过一：您发出的指令不可撤销，平台有权根据您的指令委托银行或第三方从银行卡中划扣资金给收款人。届时您不应以非本人意愿交易或其他任何原因要求平台退款或承担其他责任。
您对使用本服务过程中填写信息、发出指令的合法性、真实性及有效性承担全部责任；您承诺，平台依照您的指令进行操作的一切法律后果由您承担。且您认可您对本服务使用记录数据、交易金额数据等均以平台系统中记录的数据为准。同时您授权平台有权留存您的该等数据信息作为其常规商业档案的一部分，并认为更好的向您提供其他服务而使用，或提供给您的发行卡、国家司法机关、行政机关等权利机构配合调查、处理而使用。
您理解并同意出现邪猎情况之一时，凭条有权停止为您提供本服务，并向银行传递该信息：
1.您主动停止使用本服务的;
2.你的实际支付金额大于支付限额的；
3.你的银行卡撤户、过期、挂失等状态异常或余额不足的；
4.你涉嫌利用本服务进行套现、虚假交易、洗钱或任何其他非法活动、欺诈或违反诚信原则的行为的，或您拒绝配合平台进行关于您是否涉嫌上述行为的相关调查的；
5. 平台发现您涉嫌违反法律法规等相关规定，而被上述一网站终止提供服务的；
6.平台根据其自身商业判断或银行传递的信息，决定终止向您提供本服务的；
您同意，本协议使用中华人民共和国大陆地区法律。因平台与您就本协议商解决。如协商不成，任何一方均可向上还仲裁委员会申请仲裁。
本协议内容包括协议正文及所有平台已经发布的或哦将来可能发布的平台认证支付服务的使用规则。所有规则为本协议不可分割的一部分，与协议正文具有相同法律效力。若您在本协议内容发生修订后，继续使用本服务的，则视为您同意最新修订的协议内容；否则您须立即停止使用本协议涉及的服务并通知平台。
平台有权对本协议所有条款适时进行修改，若果您对此持有异议，可以选择终止本协议。如果继续使用本协议项下的相关服务，则视为您已经完全接受本协议相关条款的修改。 </p>
	</div>
</template>

<script>
export default {
	name:'agreementcontent'
}
</script>

<style scoped="scoped">
	.agreement{
		padding:0.3rem;
		margin-top:40px;
		line-height: 0.5rem;
		font-size:0.28rem;
	}
</style>